### Notebook para criar algumas análises dos dados de um hipotético E-commerce

- Dataset extraído de: [data.word](https://data.world/jerrys/sql-12-applying-functions-in-sql)

In [ ]:
#!pip install psycopg2-binary pandas matplotlib seaborn sqlalchemy

In [5]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sqlalchemy import create_engine

In [6]:
# string de conexão com o banco de dados ecommerce
senha = input('Digite a senha do banco de dados: ')
engine = create_engine(f'postgresql://postgres:{senha}@localhost:5432/ecommerce')

In [7]:
# select amostra da tabela produtos
produtos = pd.read_sql("SELECT * FROM produtos LIMIT 10;", engine)
produtos.head()

     Codigo                                       Produto   Preco
0  BS001873                         Apple Lightning Cable   21.99
1  BS001874                     SanDisk Extreme microSDXC   31.50
2  BS001875            Seagate 2TB Expansion Portable HDD   79.00
3  BS001876  TicWatch Pro 3 Ultra GPS Smartwatch Qualcomm  399.00
4  BS001877                    Webcam HD 1080p Web Camera   59.00

In [9]:
# select amostra da tabela vendas
vendas = pd.read_sql("SELECT * FROM vendas LIMIT 10;", engine)
vendas.head()

,Order ID,Date,ship-service-level,Style,Codigo,Courier Status,Qty,ship-country,Fulfillment
0,171-8536041-9190708,6/29/2022,Expedited,SET400,BS001879,Cancelled,4,AU,Yes
1,407-4176879-6571509,6/29/2022,Expedited,JNE3486,BS001890,Cancelled,2,BR,Yes
2,404-4382011-4681149,6/29/2022,Expedited,JNE3887,BS001873,Cancelled,2,BR,Yes
3,406-3412504-2471555,6/29/2022,Expedited,JNE3487,BS001888,Cancelled,2,BR,Yes
4,408-2481787-8248368,6/29/2022,Expedited,JNE3566,BS001898,Cancelled,2,BR,Yes

array(['Expedited'], dtype=object)

## Qual é o valor médio das vendas?

In [10]:
query = """
SELECT AVG(v."Qty" * p."Preco") AS ValorMedioVendas
FROM produtos p 
JOIN vendas v ON v."Codigo" = p."Codigo";	
"""
valor_medio = pd.read_sql(query, engine)

print(f'O valor médio das vendas é de $ {valor_medio["valormediovendas"][0]:.2f}')

O valor médio das vendas é de $ 493.49

## Qual país tem maior número de vendas?

In [13]:
query = """ 
SELECT "ship-country", COUNT(*) AS NumTransacoes
FROM vendas v
GROUP BY "ship-country"
ORDER BY NumTransacoes DESC
"""
transacoes = pd.read_sql(query, engine)

print(f"Os paises que mais realizaram transações foram: \n {transacoes['ship-country'][0]} e {transacoes['ship-country'][1]}, com {transacoes['numtransacoes'][0]} e {transacoes['numtransacoes'][1]} 
transações, respectivamente.")

Os paises que mais realizaram transações foram:
 BR e US, com 14384 e 14327 transações, respectivamente.

## Quanto cada país contribuiu para o valor total das vendas?

In [32]:
query = """
SELECT vendas."ship-country", SUM(produtos."Preco" * vendas."Qty") AS ValorTotalVendas
FROM vendas
JOIN produtos ON vendas."Codigo" = produtos."Codigo"
GROUP BY vendas."ship-country"
ORDER BY ValorTotalVendas DESC;
"""
valor_pais = pd.read_sql(query, engine)

print(f"O país que mais gerou receita foi {valor_pais['ship-country'][0]} com um total de $ {valor_pais['valortotalvendas'][0]:.2f}")

O país que mais gerou receita foi PT com um total de $ 7130930.44

## Quais produtos nunca foram vendidos?
Para obter essa informação, uma alternativa é fazer um LEFT JOIN no codigo do produto entre vendas e produtos. Os valores NULOS serão os que nunca foram vendidos. (Vimos isso na aula, que esse metodo testa todos as possíveis combinações, caso não encontre, esse valor ficara como nulo.)

In [25]:
query = """
SELECT produtos."Codigo", produtos."Produto"
FROM produtos
LEFT JOIN vendas ON produtos."Codigo" = vendas."Codigo"
WHERE vendas."Codigo" IS NULL;
"""

produtos_nao_vendidos = pd.read_sql(query, engine)
produtos_nao_vendidos

Empty DataFrame
Columns: [Codigo, Produto]
Index: []

## Quais são os 3 produtos menos vendidos?

In [35]:
query = """
SELECT vendas."Codigo", produtos."Produto", SUM(vendas."Qty") AS TotalVendido
FROM vendas
JOIN produtos ON vendas."Codigo" = produtos."Codigo"
GROUP BY vendas."Codigo", produtos."Produto"
ORDER BY TotalVendido ASC;
"""

produtos_menos_vendidos = pd.read_sql(query, engine)

print(f"Os produtos menos vendidos foram: \n {produtos_menos_vendidos['Produto'][0]} e {produtos_menos_vendidos['Produto'][1]}, com {produtos_menos_vendidos['totalvendido'][0]} e {produtos_menos_vendidos['totalvendido'][1]} unidades vendidas, respectivamente.")

Os produtos menos vendidos foram:
 Samsung T37F Monitor UHD 37 e Apple AirPods (3rd Generation), com 10897.0 e 12250.0 unidades vendidas, respectivamente.